Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.IsPourEnabled Method
 Determines whether pour management is enabled.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsPourEnabled()
Public Shared Function IsPourEnabled As Boolean
Return Value
Type: Boolean
true if pour is enabled; otherwise, false.
See Also
Reference
TeklaStructuresSettings Class
Tekla.Structures Namespace